name: "multilingual_e5_base_ensemble"
platform: "ensemble"

input [
    {
        name: "TEXT"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "EMBEDDING"
        data_type: TYPE_FP32
        dims: [ -1, 768 ]
    }
]

ensemble_scheduling {
    step [
        {
            model_name: "multilingual_e5_base_tokenizer"
            model_version: -1

            input_map {
                key: "TEXT"
                value: "TEXT"
            }

            output_map {
                key: "input_ids"
                value: "INPUT_IDS"
            }

            output_map {
                key: "attention_mask"
                value: "ATTENTION_MASK"
            }
        },
        {
            model_name: "multilingual_e5_base_model"
            model_version: -1
            
            input_map {
                key: "input_ids"
                value: "INPUT_IDS"
            }

            input_map {
                key: "attention_mask"
                value: "ATTENTION_MASK"
            }

            output_map {
                key: "sentence_embedding"
                value: "EMBEDDING"
            }
        }
    ]
}